## Staging: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 10 to change, 15 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                      NAME                                      |
|----------|--------------------------------------------------------------------------------|
| delete   | `module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets[&quot;10.0.2.0/24&quot;]` |
|          | `module.wordpress_vpc.aws_eip.nat[2]`                                          |
|          | `module.wordpress_vpc.aws_nat_gateway.nat_gw[2]`                               |
|          | `module.wordpress_vpc.aws_route.private_nat_gateway[2]`                        |
|          | `module.wordpress_vpc.aws_route_table.private[2]`                              |
|          | `module.wordpress_vpc.aws_route_table_association.private[2]`                  |
|          | `module.wordpress_vpc.aws_route_table_association.public[2]`                   |
|          | `module.wordpress_vpc.aws_subnet.private[2]`                                   |
|          | `module.wordpress_vpc.aws_subnet.public[2]`                                    |
| update   | `aws_security_group.wordpress_load_balancer`                                   |
|          | `aws_vpc_endpoint.ecr-api`                                                     |
|          | `aws_vpc_endpoint.ecr-dkr`                                                     |
|          | `aws_vpc_endpoint.logs`                                                        |
|          | `aws_vpc_endpoint.monitoring`                                                  |
|          | `aws_vpc_endpoint.secretsmanager`                                              |
|          | `aws_vpc_endpoint.sns`                                                         |
|          | `module.wordpress_vpc.aws_network_acl.main`                                    |
|          | `module.wordpress_vpc.aws_route.private_nat_gateway[0]`                        |
|          | `module.wordpress_vpc.aws_route.private_nat_gateway[1]`                        |
| recreate | `module.wordpress_vpc.aws_nat_gateway.nat_gw[0]`                               |
|          | `module.wordpress_vpc.aws_nat_gateway.nat_gw[1]`                               |
|          | `module.wordpress_vpc.aws_route_table_association.public[0]`                   |
|          | `module.wordpress_vpc.aws_route_table_association.public[1]`                   |
|          | `module.wordpress_vpc.aws_subnet.public[0]`                                    |
|          | `module.wordpress_vpc.aws_subnet.public[1]`                                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.wordpress_load_balancer will be updated in-place
  ~ resource "aws_security_group" "wordpress_load_balancer" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.0.2.0/24",
                ]
              - description      = "Traffic to ECS cluster"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
            # (2 unchanged elements hidden)
        ]
        id                     = "sg-070d59d6f18bdd547"
        name                   = "wordpress-load-balancer"
        tags                   = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_vpc_endpoint.ecr-api will be updated in-place
  ~ resource "aws_vpc_endpoint" "ecr-api" {
        id                         = "vpce-01fdbd4289c805c89"
      ~ subnet_ids                 = [
          - "subnet-0cf5c9e13fc3c306c",
            # (2 unchanged elements hidden)
        ]
        tags                       = {}
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_vpc_endpoint.ecr-dkr will be updated in-place
  ~ resource "aws_vpc_endpoint" "ecr-dkr" {
        id                         = "vpce-0e53fdd2d2b5556bf"
      ~ subnet_ids                 = [
          - "subnet-0cf5c9e13fc3c306c",
            # (2 unchanged elements hidden)
        ]
        tags                       = {}
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_vpc_endpoint.logs will be updated in-place
  ~ resource "aws_vpc_endpoint" "logs" {
        id                         = "vpce-0f7cf2446c5dacb50"
      ~ subnet_ids                 = [
          - "subnet-0cf5c9e13fc3c306c",
            # (2 unchanged elements hidden)
        ]
        tags                       = {}
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_vpc_endpoint.monitoring will be updated in-place
  ~ resource "aws_vpc_endpoint" "monitoring" {
        id                         = "vpce-0ca295c5daf8a4a0f"
      ~ subnet_ids                 = [
          - "subnet-0cf5c9e13fc3c306c",
            # (2 unchanged elements hidden)
        ]
        tags                       = {}
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_vpc_endpoint.secretsmanager will be updated in-place
  ~ resource "aws_vpc_endpoint" "secretsmanager" {
        id                         = "vpce-0cdcd1790b8452074"
      ~ subnet_ids                 = [
          - "subnet-0cf5c9e13fc3c306c",
            # (2 unchanged elements hidden)
        ]
        tags                       = {}
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_vpc_endpoint.sns will be updated in-place
  ~ resource "aws_vpc_endpoint" "sns" {
        id                         = "vpce-0aa12e09a4eecb768"
      ~ subnet_ids                 = [
          - "subnet-0cf5c9e13fc3c306c",
            # (2 unchanged elements hidden)
        ]
        tags                       = {}
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpn.aws_ec2_client_vpn_authorization_rule.this_subnets["10.0.2.0/24"] will be destroyed
  # (because key ["10.0.2.0/24"] is not in for_each map)
  - resource "aws_ec2_client_vpn_authorization_rule" "this_subnets" {
      - access_group_id        = (sensitive value) -> null
      - authorize_all_groups   = false -> null
      - client_vpn_endpoint_id = "cvpn-endpoint-0e6ece85a1c8e958c" -> null
      - description            = "Rule name: 10.0.2.0/24" -> null
      - id                     = "cvpn-endpoint-0e6ece85a1c8e958c,10.0.2.0/24,9cbda578-5051-70d8-d226-144cf96ff576" -> null
      - target_network_cidr    = "10.0.2.0/24" -> null
    }

  # module.wordpress_vpc.aws_eip.nat[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_eip" "nat" {
      - allocation_id            = "eipalloc-07adaa6b0e4dc8cff" -> null
      - arn                      = "arn:aws:ec2:ca-central-1:729164266357:elastic-ip/eipalloc-07adaa6b0e4dc8cff" -> null
      - association_id           = "eipassoc-0659280f83f21e4c0" -> null
      - domain                   = "vpc" -> null
      - id                       = "eipalloc-07adaa6b0e4dc8cff" -> null
      - network_border_group     = "ca-central-1" -> null
      - network_interface        = "eni-040db6bdeb15769c8" -> null
      - private_dns              = "ip-10-0-5-8.ca-central-1.compute.internal" -> null
      - private_ip               = "10.0.5.8" -> null
      - public_dns               = "ec2-3-97-212-33.ca-central-1.compute.amazonaws.com" -> null
      - public_ip                = "3.97.212.33" -> null
      - public_ipv4_pool         = "amazon" -> null
      - tags                     = {
          - "CostCentre" = "PlatformGCArticles"
          - "Name"       = "wordpress-eip2"
          - "Terraform"  = "true"
        } -> null
      - tags_all                 = {
          - "CostCentre" = "PlatformGCArticles"
          - "Name"       = "wordpress-eip2"
          - "Terraform"  = "true"
        } -> null
      - vpc                      = true -> null
        # (5 unchanged attributes hidden)
    }

  # module.wordpress_vpc.aws_nat_gateway.nat_gw[0] must be replaced
-/+ resource "aws_nat_gateway" "nat_gw" {
      ~ association_id                     = "eipassoc-0ae95da21f897f81b" -> (known after apply)
      ~ id                                 = "nat-056438ea86aa01cd2" -> (known after apply)
      ~ network_interface_id               = "eni-0e17840f57f37e211" -> (known after apply)
      ~ private_ip                         = "10.0.3.186" -> (known after apply)
      ~ public_ip                          = "3.98.51.94" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-0fe54b418fdd5931c" -> (known after apply) # forces replacement
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress-natgw-0"
            "Terraform"  = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.wordpress_vpc.aws_nat_gateway.nat_gw[1] must be replaced
-/+ resource "aws_nat_gateway" "nat_gw" {
      ~ association_id                     = "eipassoc-09ecbb303df39a6fb" -> (known after apply)
      ~ id                                 = "nat-0ffd1c291f8078a27" -> (known after apply)
      ~ network_interface_id               = "eni-0227c3b5cce19b2a8" -> (known after apply)
      ~ private_ip                         = "10.0.4.202" -> (known after apply)
      ~ public_ip                          = "3.97.42.113" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-0915f93428546342d" -> (known after apply) # forces replacement
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress-natgw-1"
            "Terraform"  = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.wordpress_vpc.aws_nat_gateway.nat_gw[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_nat_gateway" "nat_gw" {
      - allocation_id                      = "eipalloc-07adaa6b0e4dc8cff" -> null
      - association_id                     = "eipassoc-0659280f83f21e4c0" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-0c72d41043dd03aba" -> null
      - network_interface_id               = "eni-040db6bdeb15769c8" -> null
      - private_ip                         = "10.0.5.8" -> null
      - public_ip                          = "3.97.212.33" -> null
      - secondary_allocation_ids           = [] -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-0f8fa6af578d92096" -> null
      - tags                               = {
          - "CostCentre" = "PlatformGCArticles"
          - "Name"       = "wordpress-natgw-2"
          - "Terraform"  = "true"
        } -> null
      - tags_all                           = {
          - "CostCentre" = "PlatformGCArticles"
          - "Name"       = "wordpress-natgw-2"
          - "Terraform"  = "true"
        } -> null
    }

  # module.wordpress_vpc.aws_network_acl.main will be updated in-place
  ~ resource "aws_network_acl" "main" {
        id         = "acl-0e0d63f417ef79450"
      ~ subnet_ids = [
          - "subnet-01c6089a83b13d355",
          - "subnet-073d9db0d5d9f213c",
          - "subnet-0915f93428546342d",
          - "subnet-0cf5c9e13fc3c306c",
          - "subnet-0f8fa6af578d92096",
          - "subnet-0fe54b418fdd5931c",
        ] -> (known after apply)
        tags       = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress_main_nacl"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.wordpress_vpc.aws_route.private_nat_gateway[0] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                          = "r-rtb-0d8036177d16501e41080289494"
      ~ nat_gateway_id              = "nat-056438ea86aa01cd2" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.wordpress_vpc.aws_route.private_nat_gateway[1] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                          = "r-rtb-08ca6ad668c30537b1080289494"
      ~ nat_gateway_id              = "nat-0ffd1c291f8078a27" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.wordpress_vpc.aws_route.private_nat_gateway[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block      = "0.0.0.0/0" -> null
      - id                          = "r-rtb-0ab100c44e417f47f1080289494" -> null
      - nat_gateway_id              = "nat-0c72d41043dd03aba" -> null
      - origin                      = "CreateRoute" -> null
      - route_table_id              = "rtb-0ab100c44e417f47f" -> null
      - state                       = "active" -> null
        # (13 unchanged attributes hidden)

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.wordpress_vpc.aws_route_table.private[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:ca-central-1:729164266357:route-table/rtb-0ab100c44e417f47f" -> null
      - id               = "rtb-0ab100c44e417f47f" -> null
      - owner_id         = "729164266357" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - nat_gateway_id             = "nat-0c72d41043dd03aba"
                # (11 unchanged attributes hidden)
            },
        ] -> null
      - tags             = {
          - "CostCentre" = "PlatformGCArticles"
          - "Name"       = "wordpress_private_route_table_2"
          - "Terraform"  = "true"
        } -> null
      - tags_all         = {
          - "CostCentre" = "PlatformGCArticles"
          - "Name"       = "wordpress_private_route_table_2"
          - "Terraform"  = "true"
        } -> null
      - vpc_id           = "vpc-0a2a6b74a05f77fd1" -> null
    }

  # module.wordpress_vpc.aws_route_table_association.private[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-03e6e7f5c15a9c3c1" -> null
      - route_table_id = "rtb-0ab100c44e417f47f" -> null
      - subnet_id      = "subnet-0cf5c9e13fc3c306c" -> null
        # (1 unchanged attribute hidden)
    }

  # module.wordpress_vpc.aws_route_table_association.public[0] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-06f83c4e057dfa6b9" -> (known after apply)
      ~ subnet_id      = "subnet-0fe54b418fdd5931c" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.wordpress_vpc.aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-00e602573f1188d7a" -> (known after apply)
      ~ subnet_id      = "subnet-0915f93428546342d" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.wordpress_vpc.aws_route_table_association.public[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0d90b9f0ab5647866" -> null
      - route_table_id = "rtb-07bf0228c72f0a1e6" -> null
      - subnet_id      = "subnet-0f8fa6af578d92096" -> null
        # (1 unchanged attribute hidden)
    }

  # module.wordpress_vpc.aws_subnet.private[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:ca-central-1:729164266357:subnet/subnet-0cf5c9e13fc3c306c" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ca-central-1d" -> null
      - availability_zone_id                           = "cac1-az4" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0cf5c9e13fc3c306c" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "729164266357" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "CostCentre" = "PlatformGCArticles"
          - "Name"       = "wordpress_private_subnet_ca-central-1d"
          - "Terraform"  = "true"
          - "Tier"       = "Private"
        } -> null
      - tags_all                                       = {
          - "CostCentre" = "PlatformGCArticles"
          - "Name"       = "wordpress_private_subnet_ca-central-1d"
          - "Terraform"  = "true"
          - "Tier"       = "Private"
        } -> null
      - vpc_id                                         = "vpc-0a2a6b74a05f77fd1" -> null
        # (4 unchanged attributes hidden)

      - timeouts {
          - delete = "40m" -> null
        }
    }

  # module.wordpress_vpc.aws_subnet.public[0] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:ca-central-1:729164266357:subnet/subnet-0fe54b418fdd5931c" -> (known after apply)
      ~ availability_zone_id                           = "cac1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.0.3.0/24" -> "10.0.2.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0fe54b418fdd5931c" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "729164266357" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress_public_subnet_ca-central-1a"
            "Terraform"  = "true"
            "Tier"       = "Public"
        }
        # (12 unchanged attributes hidden)
    }

  # module.wordpress_vpc.aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:ca-central-1:729164266357:subnet/subnet-0915f93428546342d" -> (known after apply)
      ~ availability_zone_id                           = "cac1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.0.4.0/24" -> "10.0.3.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0915f93428546342d" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "729164266357" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress_public_subnet_ca-central-1b"
            "Terraform"  = "true"
            "Tier"       = "Public"
        }
        # (12 unchanged attributes hidden)
    }

  # module.wordpress_vpc.aws_subnet.public[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:ca-central-1:729164266357:subnet/subnet-0f8fa6af578d92096" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ca-central-1d" -> null
      - availability_zone_id                           = "cac1-az4" -> null
      - cidr_block                                     = "10.0.5.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0f8fa6af578d92096" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "729164266357" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "CostCentre" = "PlatformGCArticles"
          - "Name"       = "wordpress_public_subnet_ca-central-1d"
          - "Terraform"  = "true"
          - "Tier"       = "Public"
        } -> null
      - tags_all                                       = {
          - "CostCentre" = "PlatformGCArticles"
          - "Name"       = "wordpress_public_subnet_ca-central-1d"
          - "Terraform"  = "true"
          - "Tier"       = "Public"
        } -> null
      - vpc_id                                         = "vpc-0a2a6b74a05f77fd1" -> null
        # (4 unchanged attributes hidden)
    }

Plan: 6 to add, 10 to change, 15 to destroy.

Changes to Outputs:
  ~ private_subnet_ids                  = [
        # (1 unchanged element hidden)
        "subnet-01c6089a83b13d355",
      - "subnet-0cf5c9e13fc3c306c",
    ]
  ~ public_subnet_ids                   = [
      - "subnet-0fe54b418fdd5931c",
      - "subnet-0915f93428546342d",
      - "subnet-0f8fa6af578d92096",
      + (known after apply),
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_events_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.vpc_endpoint"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.wordpress_ecs"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.wordpress_load_balancer"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr-dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.monitoring"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.secretsmanager"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sns"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
